/**----------------------------------------------------------------------------
Проект:     SDK-2.0 
Название:   
Файл:       common.h
Версия:     1.0.1

Описание:   

Автор:      Ключев А.О.
Изменения:
-------------------------------------------------------------------------------
N     Дата      Версия      Автор           Описание   
-------------------------------------------------------------------------------
1   31.01.05    1.0.1   Ключев А.О.      Базовая версия
-----------------------------------------------------------------------------*/

#ifndef __COMMON_H
#define __COMMON_H

extern int kbhit( void );
extern unsigned long clock( void );
extern unsigned long clock_mcs( void );

extern void disable_interrupts( void );
extern void enable_interrupts( void );

#endif // __COMMON_H
