/**----------------------------------------------------------------------------
Проект:     SDK-2.0 
Название:   Коды ошибок
Файл:       error.h
Версия:     1.0.1

Описание:   


Автор:      Ключев А.О.
Изменения:
-------------------------------------------------------------------------------
N     Дата      Версия      Автор           Описание   
-------------------------------------------------------------------------------
1   01.02.05    1.0.1   Ключев А.О.      Базовая версия
-----------------------------------------------------------------------------*/

#ifndef __ERROR_H
#define __ERROR_H

#define OK          0
#define ERROR       1
#define ERR         1

#endif // __ERROR_H
