/**----------------------------------------------------------------------------
Проект:     SDK-2.0 
Название:   Инициализация контроллера
Файл:       init.h
Версия:     1.0.2

Описание:   В данном модуле находится вызов всех функций инициализации


Автор:      Ключев А.О.
Изменения:
-------------------------------------------------------------------------------
N     Дата      Версия      Автор           Описание   
-------------------------------------------------------------------------------
1   01.02.05    1.0.1       Ключев А.О.     Базовая версия
-----------------------------------------------------------------------------*/

#ifndef __INIT_H
#define __INIT_H

extern void init_pio();
extern int init ( void );  


#endif // __INIT_H
