/**----------------------------------------------------------------------------
Проект:     SDK-2.0 
Название:   Драйвер SPI
Файл:       spi.h
Версия:     1.0.1

Описание:   


Автор:      Ключев А.О.
Изменения:
-------------------------------------------------------------------------------
N     Дата      Версия      Автор           Описание   
-------------------------------------------------------------------------------
1   26.05.06    1.0.1   Ключев А.О.      Базовая версия
------------------------------------------------------------------------------*/

#ifndef __SPI_H
#define __SPI_H

#include <settings.h>

void init_spi1( void );
void spi1_select( int on );
unsigned char spi1_exchange( unsigned char to, unsigned char* from );
//unsigned char spi1_exchange( unsigned char c, unsigned char * err );

#endif // __SPI_H
