/**----------------------------------------------------------------------------
Проект:     SDK-2.0 
Название:   Драйвер перемычек
Файл:       sw.h
Версия:     1.0.1

Описание:   


Автор:      Ключев А.О.
Изменения:
-------------------------------------------------------------------------------
N     Дата      Версия      Автор           Описание   
-------------------------------------------------------------------------------
1   01.02.05    1.0.1   Ключев А.О.      Базовая версия
------------------------------------------------------------------------------*/

#ifndef __SW_H
#define __SW_H

#include <settings.h>

extern void init_sw();
extern unsigned char sw3 ( unsigned long sw3_name );  
extern unsigned char sw3_byte ();
extern unsigned char sw4 ( unsigned long sw4_name );  
extern unsigned char sw4_byte ();

#endif // __SW_H
