/**----------------------------------------------------------------------------
Проект:     SDK-2.0 
Название:   Драйвер сторожевого таймера
Файл:       wdt.c
Версия:     1.0.1

Описание:   


Автор:      Ключев А.О.
Изменения:
-------------------------------------------------------------------------------
N     Дата      Версия      Автор           Описание   
-------------------------------------------------------------------------------
1   07.02.05    1.0.1   Ключев А.О.      Базовая версия
------------------------------------------------------------------------------*/

#ifndef __WDT_H
#define __WDT_H

#include <settings.h>

#define WDT_PONR     0 // рестарт после включения птания
#define WDT_RESTART  1 // зафиксирован рестарт WDT 

extern int  init_wdt( );
extern void reset_wdt ();  
extern int  get_wdt_state();

#endif // __WDT_H
