/**----------------------------------------------------------------------------
Проект:     SDK-2.0 
Название:   Управление светодиодными индикаторами
Файл:       led.c
Версия:     1.0.3

Описание:   В данном модуле находится драйвер светодиода "STATUS"
			и линейки светодиодов


Автор:      Ключев А.О.
Изменения:
-------------------------------------------------------------------------------
N     Дата      Версия      Автор           Описание   
-------------------------------------------------------------------------------
1   31.01.05    1.0.1   Ключев А.О.			Базовая версия
2	12.01.06	1.0.2	Петров Е.В.			светодиод STATUS
3	12.01.06	1.0.3	Ковязина Д.Р.		Линейка светодиодов
------------------------------------------------------------------------------*/

#include <leds.h>

/**----------------------------------------------------------------------------
Инициализация светодиодов
-----------------------------------------------------------------------------*/
void init_led()
{
    init_led_status();
	init_led_line();
}

/**----------------------------------------------------------------------------
                            init_led_status
-------------------------------------------------------------------------------
Инициализация портов для работы со статусным светодиодом

Вход:       mode - режим рыботы драйвера 
Выход:      нет
Результат:  нет
Описание:   
Пример:
-----------------------------------------------------------------------------*/
void init_led_status()
{
    P_LED_DIR |= P_LED_STATUS;    
}

/**----------------------------------------------------------------------------
                            led
-------------------------------------------------------------------------------
Управление статусным светодиодом

Вход:       led_name - имя светодиода (LED_xxxxxx), mode - режим 
            работы (LED_ON, LED_OFF )
Выход:      нет
Результат:  нет
Описание:   
Пример:
-----------------------------------------------------------------------------*/
void led ( int led_name, int mode )  
{                
    if( mode == LED_ON ) 
        P_LED_SET = led_name; 
    else
        P_LED_CLR = led_name;
}                                

/**----------------------------------------------------------------------------
Инициализация линейки светодиодов
-----------------------------------------------------------------------------*/
void init_led_line(void)
{
    //Настройка направления выводов порта для светодиодов
    CONFIG_DIR_LED |= LED0 | LED1 | LED2 | LED3 | SEL_04 | SEL_40;
}

/**----------------------------------------------------------------------------
Управление линейкой светодиодов
Only one nibble may be active at once.
-----------------------------------------------------------------------------*/
void leds(unsigned char light)
{
	CLR_LED |= LED0 | LED1 | LED2 | LED3;	
	SET_LED |= SEL_04;
	SET_LED |= SEL_40;
	CLR_LED |= SEL_04;
	CLR_LED |= SEL_40;
		
    if(light & 0xF0) { // most significant nibble takes priority
  		CLR_LED |= SEL_04;
		SET_LED |= SEL_40;
        if(light & (0x10 << 0)) 
        	SET_LED |= LED0;
        else
        	CLR_LED |= LED0;
        if(light & (0x10 << 1)) 
        	SET_LED |= LED1;
        else                     
        	CLR_LED |= LED1;
        if(light & (0x10 << 2)) 
        	SET_LED |= LED2;
        else                     
        	CLR_LED |= LED2;
        if(light & (0x10 << 3)) 
        	SET_LED |= LED3;
        else                     
        	CLR_LED |= LED3;
    } else if(light & 0x0F) {
		CLR_LED |= SEL_40;
		SET_LED |= SEL_04;
        if(light & (0x01 << 0)) 
        	SET_LED |= LED0;
        else
        	CLR_LED |= LED0;
        if(light & (0x01 << 1)) 
        	SET_LED |= LED1;
        else                     
        	CLR_LED |= LED1;
        if(light & (0x01 << 2)) 
        	SET_LED |= LED2;
        else                     
        	CLR_LED |= LED2;
        if(light & (0x01 << 3)) 
        	SET_LED |= LED3;
        else                     
        	CLR_LED |= LED3;
    }
}
