/**----------------------------------------------------------------------------
Проект:     SDK-2.0 
Название:   Драйвер последовательного канала
Файл:       serial.c
Версия:     1.0.1

Описание:   Реализация байтового ввода вывода через контроллеры UART0 и UART1
            для микроконтроллера Philips LPC2294

Автор:      Ключев А.О.
Изменения:
-------------------------------------------------------------------------------
N     Дата      Версия      Автор           Описание   
-------------------------------------------------------------------------------
1   31.01.05    1.0.1   Ключев А.О.      Базовая версия
-----------------------------------------------------------------------------*/

#include <stdio.h>
#include <serial.h>                     
#include <systimer.h>         

char buf[80];   // Массив для работы со строками (НЕ ИСПОЛЬЗОВАТЬ в нескольких процессах!!! )

static void init_serial0( void );
static void init_serial1( void );

/*-----------------------------------------------------------------------------
Установка направления передачи RS485
mode = 0 - прием
mode = 1 - передача
-----------------------------------------------------------------------------*/
void rs485_direction( int mode )
{
    if( mode )
        U1MCR = 2;
    else
        U1MCR = 0;
}


/*-----------------------------------------------------------------------------
Инициализация последовательных интерфейсов (UART, RS485)
-----------------------------------------------------------------------------*/
void init_serial( void )
{
    init_serial0();
    init_serial1();
}

/*-----------------------------------------------------------------------------
Запись символа в последовательный канал
-----------------------------------------------------------------------------*/
void wsio0 (unsigned char ch)  
{         
    
    while ( ! ( U0LSR & 0x20 ) );

    U0THR = ch;


}

/*-----------------------------------------------------------------------------
Чтение символа из последовательного канала
-----------------------------------------------------------------------------*/
unsigned char rsio0 (void)  
{   
    rs485_direction( 0 ); // прием

    while ( ! ( U0LSR & 0x01 ) );

    return ( U0RBR );
}

/*-----------------------------------------------------------------------------
Чтение признака наличия прочитанного символа из последовательного канала
-----------------------------------------------------------------------------*/
int rsiostat0( void )
{
    return ( U0LSR & 0x01 );
}


/*-----------------------------------------------------------------------------
Запись символа в RS485
-----------------------------------------------------------------------------*/
void wsio1 (unsigned char ch)  
{                  
    rs485_direction( 1 ); // передача

    U1THR = ch;
    while ( ! ( U1LSR & 0x20 ) );

    delay_ms( 2 );

    rs485_direction( 0 ); // прием

}

/*-----------------------------------------------------------------------------
Чтение символа из RS485
-----------------------------------------------------------------------------*/
unsigned char rsio1 (void)  
{                    
    rs485_direction( 0 ); // прием

    while ( ! ( U1LSR & 0x01 ) );

    return ( U1RBR );
}



/*-----------------------------------------------------------------------------
Чтение признака наличия прочитанного символа из RS485
-----------------------------------------------------------------------------*/
int rsiostat1( void )
{
    return ( U1LSR & 0x01 );
}


/*-----------------------------------------------------------------------------
Инициализация UART
-----------------------------------------------------------------------------*/
static void init_serial0( void )
{
    U0LCR   = 0x83;
    U0DLL   = 78;         // X = Fosc / (16 * 9600)    
    U0DLM   = 0x00;
    U0LCR   = 0x03;       // DLAB = 0

}

/*-----------------------------------------------------------------------------
Инициализация RS485
-----------------------------------------------------------------------------*/
static void init_serial1( void )
{
    U1LCR   = 0x83;
    U1DLL   = 78;         // X = Fosc / (16 * 9600)    
    U1DLM   = 0x00;
    U1LCR   = 0x03;       // DLAB = 0

//    U1MCR   = 2;        // Включаем аппаратное управление сигналом RTS.
                          // Этот сигнал автоматически переключает приемопередатчик RS485 в 
                          // нужное направление (прием/передача).  
}

