/**----------------------------------------------------------------------------
Проект:     SDK-2.0
Название:   Настройки проекта
Файл:       settings.h
Версия:     1.0.1

Описание:   


Автор:      Ключев А.О.
Изменения:
-------------------------------------------------------------------------------
N     Дата      Версия      Автор           Описание   
-------------------------------------------------------------------------------
1   01.02.05    1.0.1   Ключев А.О.      Базовая версия
-----------------------------------------------------------------------------*/

#ifndef __SETTINGS_H
#define __SETTINGS_H

#include <error.h>
#include <sdk_2_0.h>

#define ETH_DEBUG   1


#endif // __SETTINGS_H
