/**----------------------------------------------------------------------------
Проект:     SDK-2.0 
Название:   Драйвер SPI1
Файл:       spi.c
Версия:     1.0.1

Описание:   

Автор:      Ключев А.О.
Изменения:
-------------------------------------------------------------------------------
N     Дата      Версия      Автор           Описание   
-------------------------------------------------------------------------------
1   05.05.06    1.0.1   Ключев А.О.      Базовая версия
------------------------------------------------------------------------------*/

#include <spi.h>

/* ----------------------------------------------------------------------------
                        Интерфейс модуля
-----------------------------------------------------------------------------*/

/**----------------------------------------------------------------------------
                            spi1_init
-------------------------------------------------------------------------------
Инициализация портов для работы с spi

Вход:       нет
Выход:      нет
Результат:  нет
Описание:   

-----------------------------------------------------------------------------*/
void init_spi1( void )
{
// Переводим порты ввода-вывода в режим работы с SPI1
// -----------------------------------------------------------------------------------------------------------
//         Pin   Name  Function when 00  Function when 01     Function when 10  Function when 11    Reset Value
// -----------------------------------------------------------------------------------------------------------
// PINSEl1 3:2   P0.17 GPIO Port 0.17    Capture 1.2 (TIMER1) SCK (SPI1)        Match 1.2 (TIMER1)  00
// PINSEl1 5:4   P0.18 GPIO Port 0.18    Capture 1.3 (TIMER1) MISO (SPI1)       Match 1.3 (TIMER1)  00
// PINSEl1 7:6   P0.19 GPIO Port 0.19    Match 1.2 (TIMER1)   MOSI (SPI1)       Match 1.3 (TIMER1)  00
// PINSEl1 9:8   P0.20 GPIO Port 0.20    Match 1.3 (TIMER1)   SSEL (SPI1)       EINT3               00
// -----------------------------------------------------------------------------------------------------------
// PINSEL0 29:28 P0.14 GPIO Port 0.14    CD (UART1)           EINT1             Reserved            00
// -----------------------------------------------------------------------------------------------------------
    PINSEL1 &= 0xFFFFFC03; //    P0.19 MOSI         (SPI)
    PINSEL1 |= 0x000002A8; //    P0.18 MISO         (SPI)
                           //    P0.17 SCK1         (SPI)

    PINSEL0 &= 0xCFFFFFFF;  //   P0.14 nCC2420_SSEL (GPIO, Out)

    IO0DIR  |= P_14;         //   DIR = 1, Out
    IO0SET  |= P_14;         //   1 - неактивный уровень CS

	// Настраиваем контроллер SPI
    S1SPCR  = 0x20; // CPOL = 0, CPHA = 0, MSTR = 1, LSBF = 0 (MSB first), SPIE = 0
    S1SPCCR = 8; // 1,5MHz
//    S1SPCCR = 6; // 2MHz
}

/**----------------------------------------------------------------------------
                spi_select              
-------------------------------------------------------------------------------

Выбор SPI-устройства, с которым производится работа.

вход:      нет
выход:     нет
результат: нет

Описание:   
Пример:
-----------------------------------------------------------------------------*/
void spi1_select( int on )  
{                
    if ( on )
        IO0CLR  = P_14;           //   0 - активный уровень CS
    else        
        IO0SET  = P_14;           //   1 - неактивный уровень CS
}                                

////////////////////////////////////////////////////////////////////////////////
// Передача и прием байта по интерфейсу SPI. Если за определенный временной
// интервал данные не были получены, ошибки об этом не сообщается.
//   вход:      to - предаваемый байт
//   выход:     *from - прочитанный байт
//   результат: ошибка или успех
////////////////////////////////////////////////////////////////////////////////
unsigned char spi1_exchange( unsigned char to, unsigned char* from )
{
    unsigned char err = OK;

    S1SPDR = to;
    while ( 1 )
    {
        if ( S1SPSR & 0x80 )
        {
            *from = S1SPDR;
            break;
        }

        if ( S1SPSR & 0x78 ) 
        {
		    S1SPCR  = 0x20;		// CPOL = 0, CPHA = 0, MSTR = 1, LSBF = 0 (MSB first), SPIE = 0
            *from = S1SPDR;
            err = ERR;
            break;
        }
    }

    return err;
}

/*//----------------------------------------------------------------------------
//                            spi1_exchandge
//-------------------------------------------------------------------------------
//Передача и прием байта по интерфейсу SPI. Если за определенный временной
//интервал данные не были получены, ошибки об этом не сообщается.
//
//вход:      c   предаваемый байт
//выход:     нет
//результат: прочитанный байт
//Описание:   
//Пример:
//-----------------------------------------------------------------------------
unsigned char spi1_exchange( unsigned char c, unsigned char * err )
{
    *err = 0;

//    spi1_select( 1 );

    S1SPDR = c;
    while ( 1 )
    {
        if( S1SPSR & 0x80 )
        {
            c = S1SPDR;
            break;
        }

        if( S1SPSR & 0x78 ) 
        {
            *err = 1;
            break;
        }
    }
//    spi1_select( 0 );

    return c;
}*/

