/**----------------------------------------------------------------------------
Проект:     SDK-2.0 
Название:   Драйвер перемычек
Файл:       sw.c
Версия:     1.0.1

Описание:   


Автор:      Ключев А.О.
Изменения:
-------------------------------------------------------------------------------
N     Дата      Версия      Автор           Описание   
-------------------------------------------------------------------------------
1   01.02.05    1.0.1   Ключев А.О.      Базовая версия
------------------------------------------------------------------------------*/

#include <sw.h>

/* ----------------------------------------------------------------------------
                        Интерфейс модуля
-----------------------------------------------------------------------------*/

/**----------------------------------------------------------------------------
                            init_led
-------------------------------------------------------------------------------
Инициализация портов для работы с перемычками
-----------------------------------------------------------------------------*/
void init_sw()
{
	//P0.07 = GPIO
	PINSEL0 &= 0xFFFF3FFF;

    P_SW3_DIR &= ~P_SW3_1 & ~P_SW3_2 & ~P_SW3_3 & ~P_SW3_4;
    P_SW4_DIR_12 &= ~P_SW4_1 & ~P_SW4_2;
    P_SW4_DIR_3456 &= ~P_SW4_3 & ~P_SW4_4 & ~P_SW4_5 & ~P_SW4_6;
    P_SW4_DIR_78 &= ~P_SW4_7 & ~P_SW4_8;
}

/**----------------------------------------------------------------------------
                            sw3
-------------------------------------------------------------------------------

Вход:       sw3_name - имя перемычки (P_SW3_1 | P_SW3_2 | P_SW3_3 | P_SW3_4)
Выход:      нет
Результат:  значение | считаное с перемычек: "1" означает | что соответствующая 
            перемычка замкнута. 
Описание:   
Пример:
-----------------------------------------------------------------------------*/

unsigned char sw3 ( unsigned long sw3_name )  
{                
    if( P_SW3_PIN & sw3_name )
        return 0;
    else
        return 1;
}                                


unsigned char sw3_byte() {
	return 0x0F & ~((unsigned char)(P_SW3_PIN & (P_SW3_4 | P_SW3_3 | P_SW3_2 | P_SW3_1)) >> 4);
}

/**----------------------------------------------------------------------------
                            sw4
-------------------------------------------------------------------------------


Вход:       sw4_name - имя перемычки (P_SW4_1 | P_SW4_2,... | P_SW4_8)
Выход:      нет
Результат:  значение | считаное с перемычек: "1" означает | что соответствующая 
            перемычка замкнута. 
Описание:   
Пример:
-----------------------------------------------------------------------------*/

unsigned char sw4 ( unsigned long sw4_name ) {
	unsigned long pin_read;

	switch( sw4_name )
	{
		case P_SW4_1:
		case P_SW4_2:
			pin_read = P_SW4_PIN_12;
			break;
		case P_SW4_3:
		case P_SW4_4:
		case P_SW4_5:
		case P_SW4_6:
			pin_read = P_SW4_PIN_3456;
		    break;
		/*
		case P_SW4_7:
		case P_SW4_8:
		*/
		default:
			pin_read = P_SW4_PIN_78;
		    break;
	}

    if( pin_read & sw4_name )
        return 0;
    else
        return 1;
}                                


unsigned char sw4_byte() {
	return sw4(P_SW4_8) << 7 | sw4(P_SW4_7) << 6 | sw4(P_SW4_6) << 5 | sw4(P_SW4_5) << 4 | sw4(P_SW4_4) << 3 | sw4(P_SW4_3) << 2 | sw4(P_SW4_2) << 1 | sw4(P_SW4_1);
}


/* ----------------------------------------------------------------------------
                        Локальные функции модуля
-----------------------------------------------------------------------------*/
