/**----------------------------------------------------------------------------
Проект:     SDK-2.0 
Название:   Драйвер сторожевого таймера
Файл:       wdt.c
Версия:     1.0.1

Описание:   


Автор:      Ключев А.О.
Изменения:
-------------------------------------------------------------------------------
N     Дата      Версия      Автор           Описание   
-------------------------------------------------------------------------------
1   07.02.05    1.0.1   Ключев А.О.      Базовая версия
------------------------------------------------------------------------------*/

#include <wdt.h>

static char wdt_state = WDT_PONR;

/* ----------------------------------------------------------------------------
                        Интерфейс модуля
-----------------------------------------------------------------------------*/

/**----------------------------------------------------------------------------
                            init_wdt
-------------------------------------------------------------------------------
Инициализация сторожевого таймера

Вход:       mode - режим рыботы драйвера 
Выход:      нет
Результат:  WDT_RESTART  - зафиксирован рестарт WDT, WDT_PONR - рестарт после
            подачи питания
Описание:   
Пример:
-----------------------------------------------------------------------------*/

int init_wdt()
{

    if( WDMOD & 0x4 )
        wdt_state = WDT_RESTART;
    else
        wdt_state = WDT_PONR;

    WDTC   = 3000000;
    WDMOD  = 0x03;
    WDFEED = 0xAA;
    WDFEED = 0x55;

    return wdt_state;
}


int get_wdt_state( void )
{
    return wdt_state;
}

/**----------------------------------------------------------------------------
                            reset_wdt
-------------------------------------------------------------------------------
Сброс сторожевого таймера

Вход:       нет
Выход:      нет
Результат:  
         
Описание:   
Пример:
-----------------------------------------------------------------------------*/

void reset_wdt ( void )  
{     
    WDFEED = 0xAA;
    WDFEED = 0x55;
}                                
